backend/app/Http/Controllers/Api/AuthController.php

select * from "users" where "email" = 'iv3d@yahoo.com' limit 1
---
    public function login(Request $request): JsonResponse
    {
        $request->validate([
            'email' => 'required|email|max:255',
            'password' => 'required|string|min:8|max:255'
        ]);

        $user = User::where('email', $request->email)->first();